# WireTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet Class
Members See Also
---
A set that contains wire types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class WireTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class WireTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireTypeSet
# See Also
WireTypeSet Members
Autodesk.Revit.DB.Electrical Namespace